<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"def8d59dcd1266c13a89c77843739c1ed1acc44fa3555fba3de44b04c21f9d2c","plan_job_ref":"Job PR Plan #19 at https://github.com/JunzhongLin/proj_gcp_template/actions/runs/12959191040","plan_out_hash":"875b60c81c3f20a5146a05df550ff84692957b44abdfc080d3593a65cd4f0870","plan_hash":"606d009cb174f30357eab477bfa6470d7086438936dcdf96edefcbeed34f8354","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __terraform__
With backend config files: `terraform/backend.conf`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_storage_bucket.dummy_bucket will be created
+   resource "google_storage_bucket" "dummy_bucket" {
+       force_destroy               = false
+       id                          = (known after apply)
+       labels                      = (known after apply)
+       location                    = "EUROPE-WEST1"
+       name                        = "dummy1234-develop-448321"
+       project                     = "develop-448321"
+       public_access_prevention    = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       uniform_bucket_level_access = (known after apply)
+       url                         = (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [PR Plan #19](https://github.com/JunzhongLin/proj_gcp_template/actions/runs/12959191040)